title: Failed Logon Attempts
id: 236a5b9d-e54c-4553-b040-80e626b27894
status: experimental
description: Detects suspicious failed logon attempts
author: Philip Zangara
date: 2026/06/06
tags:
    - attack.credential_access
    - attack.t1110
logsource:
    category: security
    product: windows
detection:
    selection:
        EventID: 4625
        LogName: Security
    condition: selection
falsepositives:
    - Legitimate logon attempts
level: medium